Revit 2026 API

# Transaction(Document) Constructor

---

Instantiates a transaction object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transaction(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
Transaction(
	Document^ document
)
```
```fsharp
new :
        document : Document -> Transaction
```

#### Parameters

document Document
     The document for which this transaction is going to be used.

| Exception | Condition |
| --- | --- |
| ArgumentException | Document is a linked file. Transactions can only be used in primary documents (projects or families.) |
| ArgumentNullException | A non-optional argument was null |

The transaction does not start by creating a transaction object. One of the 'Start' methods will need to be called in order to start this transaction.

A transaction cannot start unless is has a valid (non-empty) name. Because this constructor does not take a name, a name must be assigned later before or during the 'Start' method.

#### Reference

Transaction Class

Transaction Overload

Autodesk.Revit.DB Namespace